// 配列を定義（as constで不変にする）
export const TAG_LIST = [
	'森林',
	'森林歩道',
	'林道',
	'地図',
	'地形',
	'田んぼ',
	'地質図',
	'河川',
	'鳥獣保護区',
	'道路',
	'建物',
	'国有林',
	'街路樹',
	'土壌図',
	'微地形図',
	'赤色立体地図',
	'傾斜区分図',
	'傾斜量図',
	'基本図',
	'背景地図',
	'国有林',
	'植生図',
	'林班',
	'小班',
	'林相図',
	'レーザ林相図',
	'単木',
	'看板',
	'写真',
	'地すべり',
	'フェノロジー',
	'DEM',
	'DSM',
	'DCHM',
	'TWI',
	'樹冠高',
	'メッシュ',
	'10m解像度', // 14
	'5m解像度', // 15
	'2.5m解像度', // 16
	'1m解像度', // 17
	'0.5m解像度', // 18
	'0.25m解像度', // 19
	'地形分類',
	'磁気図',
	'自然災害伝承碑',
	'ジオイド高',
	'土地被覆',
	'樹木被覆率',
	'標高段彩図',
	'施設平面図',
	'CAD',
	'点群'
] as const;

// 配列から型を生成
export type Tag = (typeof TAG_LIST)[number];
